In [135]:
import numpy as np
import pandas as pd
import sklearn
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error,mean_absolute_error
from sklearn.model_selection import train_test_split

In [136]:
df=pd.read_csv('employeesalary.csv')
df.head()

,NAME,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$81000.00,$73862.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$74628.00,$74628.00
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,$77280.00,$70174.00
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$96276.00,$96276.00
4,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,WATER MGMNT,$84032.00,$76627.00

In [137]:
df.shape

(34218, 5)

In [138]:
df.dtypes

NAME                                       object
JOB TITLE                                  object
DEPARTMENT                                 object
EMPLOYEE ANNUAL SALARY                     object
ESTIMATED ANNUAL SALARY MINUS FURLOUGHS    object
dtype: object

In [139]:
df.columns

Index(['NAME', 'JOB TITLE', 'DEPARTMENT', 'EMPLOYEE ANNUAL SALARY',
       'ESTIMATED ANNUAL SALARY MINUS FURLOUGHS'],
      dtype='object')

In [140]:
#we know that we have to estimate annual salary means 
#taget variable=df['ESTIMATED ANNUAL SALARY MINUS FURLOUGHS']

In [141]:
#sns.heatmap(df.isnull(),annot=True)

In [142]:
#There's no missing data
#still
df.isnull().sum()

NAME                                       0
JOB TITLE                                  0
DEPARTMENT                                 0
EMPLOYEE ANNUAL SALARY                     0
ESTIMATED ANNUAL SALARY MINUS FURLOUGHS    0
dtype: int64

In [143]:
df.describe()

,NAME,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
count,34218,34218,34218,34218,34218
unique,33908,1124,39,1028,1088
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,$77238.00,$77238.00
freq,4,10918,14147,3028,3028

In [144]:
df.drop(columns=["NAME"],axis=1,inplace=True)

In [145]:
df

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,WATER RATE TAKER,WATER MGMNT,$81000.00,$73862.00
1,POLICE OFFICER,POLICE,$74628.00,$74628.00
2,CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,$77280.00,$70174.00
3,CIVIL ENGINEER IV,WATER MGMNT,$96276.00,$96276.00
4,ELECTRICAL MECHANIC,WATER MGMNT,$84032.00,$76627.00
...,...,...,...,...
34213,POLICE OFFICER,POLICE,$74628.00,$74628.00
34214,CONSTRUCTION LABORER,WATER MGMNT,$73216.00,$66764.00
34215,POLICE OFFICER,POLICE,$77238.00,$77238.00
34216,LIEUTENANT,FIRE,$101958.00,$101958.00
34217,CHIEF DATA BASE ANALYST,DoIT,$110352.00,$100205.00

In [146]:
df['JOB TITLE'].unique()

array(['WATER RATE TAKER', 'POLICE OFFICER', 'CHIEF CONTRACT EXPEDITER',
       ..., 'CASE ANALYST - LAW', 'OPERATIONS ANALYST',
       'MECHANICAL ENGINEER IV'], dtype=object)

In [147]:
df['JOB TITLE'].value_counts()

POLICE OFFICER                     10918
FIREFIGHTER                         1242
FIREFIGHTER-EMT                     1198
SERGEANT                            1177
MOTOR TRUCK DRIVER                   931
                                   ...
HOUSING DEVELOPMENT COORD              1
SENIOR POLICY ANALYST                  1
COMMISSIONER OF HUMAN RESOURCES        1
DIR OF PROJECT DEVELOPMENT             1
COMMISSIONER OF HEALTH                 1
Name: JOB TITLE, Length: 1124, dtype: int64

In [148]:
df['ESTIMATED ANNUAL SALARY MINUS FURLOUGHS']=df['ESTIMATED ANNUAL SALARY MINUS FURLOUGHS'].str[1:]
df['EMPLOYEE ANNUAL SALARY']=df['EMPLOYEE ANNUAL SALARY'].str[1:]

In [149]:
df

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,WATER RATE TAKER,WATER MGMNT,81000.00,73862.00
1,POLICE OFFICER,POLICE,74628.00,74628.00
2,CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,77280.00,70174.00
3,CIVIL ENGINEER IV,WATER MGMNT,96276.00,96276.00
4,ELECTRICAL MECHANIC,WATER MGMNT,84032.00,76627.00
...,...,...,...,...
34213,POLICE OFFICER,POLICE,74628.00,74628.00
34214,CONSTRUCTION LABORER,WATER MGMNT,73216.00,66764.00
34215,POLICE OFFICER,POLICE,77238.00,77238.00
34216,LIEUTENANT,FIRE,101958.00,101958.00
34217,CHIEF DATA BASE ANALYST,DoIT,110352.00,100205.00

In [150]:
df['ESTIMATED ANNUAL SALARY MINUS FURLOUGHS']=df['ESTIMATED ANNUAL SALARY MINUS FURLOUGHS'].str[:-3]
df['EMPLOYEE ANNUAL SALARY']=df['EMPLOYEE ANNUAL SALARY'].str[:-3]

In [151]:
df

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,WATER RATE TAKER,WATER MGMNT,81000,73862
1,POLICE OFFICER,POLICE,74628,74628
2,CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,77280,70174
3,CIVIL ENGINEER IV,WATER MGMNT,96276,96276
4,ELECTRICAL MECHANIC,WATER MGMNT,84032,76627
...,...,...,...,...
34213,POLICE OFFICER,POLICE,74628,74628
34214,CONSTRUCTION LABORER,WATER MGMNT,73216,66764
34215,POLICE OFFICER,POLICE,77238,77238
34216,LIEUTENANT,FIRE,101958,101958
34217,CHIEF DATA BASE ANALYST,DoIT,110352,100205

In [152]:
import sklearn
from sklearn.preprocessing import LabelEncoder
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder() 
df['JOB TITLE']= label_encoder.fit_transform(df['JOB TITLE']) 
df['DEPARTMENT']= label_encoder.fit_transform(df['DEPARTMENT'])

In [153]:
df

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,1115,38,81000,73862
1,783,30,74628,74628
2,193,19,77280,70174
3,240,38,96276,96276
4,451,38,84032,76627
...,...,...,...,...
34213,783,30,74628,74628
34214,284,38,73216,66764
34215,783,30,77238,77238
34216,673,18,101958,101958
34217,194,14,110352,100205

Correlation

In [154]:
df.corr()

            JOB TITLE  DEPARTMENT
JOB TITLE    1.000000    0.254697
DEPARTMENT   0.254697    1.000000

In [155]:
#so i cant find any correlation

In [156]:
df.skew()

JOB TITLE                                 -0.869632
DEPARTMENT                                -1.065106
EMPLOYEE ANNUAL SALARY                    -0.571787
ESTIMATED ANNUAL SALARY MINUS FURLOUGHS   -0.686903
dtype: float64

In [157]:
import numpy as np
for col in df.columns:
    if df.skew().loc[col]>0.55:
        df[col]=np.log1p(df[col])

In [158]:
#reached a dead end
#skewness still present

In [159]:
df.skew()

JOB TITLE                                 -0.869632
DEPARTMENT                                -1.065106
EMPLOYEE ANNUAL SALARY                    -0.571787
ESTIMATED ANNUAL SALARY MINUS FURLOUGHS   -0.686903
dtype: float64

In [160]:
import numpy as np
for col in df.columns:
    if df[col].dtype!="object":
        print("column name : "+col+" and skewness is : ",df[col].skew())
        if df[col].skew() > 0.55:
            df[col]=np.sqrt(df[col])

column name : JOB TITLE and skewness is :  -0.869632232678418
column name : DEPARTMENT and skewness is :  -1.0651060650515187

In [161]:
df.skew()

JOB TITLE                                 -0.869632
DEPARTMENT                                -1.065106
EMPLOYEE ANNUAL SALARY                    -0.571787
ESTIMATED ANNUAL SALARY MINUS FURLOUGHS   -0.686903
dtype: float64

In [162]:
#not good
#still skewness is present why?

In [163]:
#i have tried one by one column too using sqrt and log to deal with skewness still no help

In [164]:

#dataset which machine can understand
df

,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,1115,38,81000,73862
1,783,30,74628,74628
2,193,19,77280,70174
3,240,38,96276,96276
4,451,38,84032,76627
...,...,...,...,...
34213,783,30,74628,74628
34214,284,38,73216,66764
34215,783,30,77238,77238
34216,673,18,101958,101958
34217,194,14,110352,100205

# Machine learning

In [165]:
#Lets seprate input and output
x=df.drop(columns=["ESTIMATED ANNUAL SALARY MINUS FURLOUGHS"])
y=df[["ESTIMATED ANNUAL SALARY MINUS FURLOUGHS"]]

In [166]:
x

       JOB TITLE  DEPARTMENT EMPLOYEE ANNUAL SALARY
0           1115          38                  81000
1            783          30                  74628
2            193          19                  77280
3            240          38                  96276
4            451          38                  84032
...          ...         ...                    ...
34213        783          30                  74628
34214        284          38                  73216
34215        783          30                  77238
34216        673          18                 101958
34217        194          14                 110352

[34218 rows x 3 columns]

In [167]:
y

      ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0                                       73862
1                                       74628
2                                       70174
3                                       96276
4                                       76627
...                                       ...
34213                                   74628
34214                                   66764
34215                                   77238
34216                                  101958
34217                                  100205

[34218 rows x 1 columns]

In [168]:
#Lets use decision tree regressor
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
def maxr2_score(regr,x,y):
    max_r_score=0
    for r_state in range(42,100):
        x_train, x_test, y_train, y_test = train_test_split(x, y,random_state = r_state,test_size=0.20)
        regr.fit(x_train,y_train)
        y_pred = regr.predict(x_test)
        r2_scr=r2_score(y_test,y_pred)
        print("r2 score corresponding to ",r_state," is ",r2_scr)
        if r2_scr>max_r_score:
            max_r_score=r2_scr
            final_r_state=r_state
    print("max r2 score corresponding to ",final_r_state," is ",max_r_score)
    return final_r_state

In [169]:
lnr=LinearRegression()
final_r_state=maxr2_score(lnr,x,y)

r2 score corresponding to  42  is  0.9830287208912687
r2 score corresponding to  43  is  0.9814374516309454
r2 score corresponding to  44  is  0.9810913991694401
r2 score corresponding to  45  is  0.9820406607461876
r2 score corresponding to  46  is  0.9818437531137457
r2 score corresponding to  47  is  0.9809201906348897
r2 score corresponding to  48  is  0.9820889642276469
r2 score corresponding to  49  is  0.981998422933547
r2 score corresponding to  50  is  0.9819869365515018
r2 score corresponding to  51  is  0.9813501964234902
r2 score corresponding to  52  is  0.9818084901167744
r2 score corresponding to  53  is  0.9814565386846773
r2 score corresponding to  54  is  0.9816885741674228
r2 score corresponding to  55  is  0.9814974768269007
r2 score corresponding to  56  is  0.9809860175389662
r2 score corresponding to  57  is  0.981409482294457
r2 score corresponding to  58  is  0.9820653683856133
r2 score corresponding to  59  is  0.9824247300246266
r2 score corresponding to  60  is  0.9811744422165918
r2 score corresponding to  61  is  0.9820176274667232
r2 score corresponding to  62  is  0.9816502731538491
r2 score corresponding to  63  is  0.9821506871533082
r2 score corresponding to  64  is  0.9815146466456559
r2 score corresponding to  65  is  0.9818433314127863
r2 score corresponding to  66  is  0.9820162089558477
r2 score corresponding to  67  is  0.9819527486580718
r2 score corresponding to  68  is  0.982080907470482
r2 score corresponding to  69  is  0.9823300737265703
r2 score corresponding to  70  is  0.9817361697026562
r2 score corresponding to  71  is  0.9811462002618683
r2 score corresponding to  72  is  0.981129495967829
r2 score corresponding to  73  is  0.9809789088875605
r2 score corresponding to  74  is  0.9817847496461635
r2 score corresponding to  75  is  0.9817087043495396
r2 score corresponding to  76  is  0.9815988814047288
r2 score corresponding to  77  is  0.9814368724502569
r2 score corresponding to  78  is  0.9804052100349397
r2 score corresponding to  79  is  0.9805326632296691
r2 score corresponding to  80  is  0.9822443447211235
r2 score corresponding to  81  is  0.9816277976997692
r2 score corresponding to  82  is  0.9808956992414632
r2 score corresponding to  83  is  0.9805396379641682
r2 score corresponding to  84  is  0.982230756134633
r2 score corresponding to  85  is  0.9813642133615655
r2 score corresponding to  86  is  0.9814711428041313
r2 score corresponding to  87  is  0.9817434503792059
r2 score corresponding to  88  is  0.9825346046654359
r2 score corresponding to  89  is  0.9808992071385417
r2 score corresponding to  90  is  0.9808494826773206
r2 score corresponding to  91  is  0.9817851076012729
r2 score corresponding to  92  is  0.9815065570110556
r2 score corresponding to  93  is  0.9813238038710934
r2 score corresponding to  94  is  0.9812651152502331
r2 score corresponding to  95  is  0.981205234037707
r2 score corresponding to  96  is  0.9820493851734918
r2 score corresponding to  97  is  0.9813051033649607
r2 score corresponding to  98  is  0.981367592543736
r2 score corresponding to  99  is  0.9814516940386927
max r2 score corresponding to  42  is  0.9830287208912687

In [170]:
from sklearn.tree import DecisionTreeRegressor
regr=DecisionTreeRegressor()
final_r_state=maxr2_score(regr,x,y)

r2 score corresponding to  42  is  0.9989929357372891
r2 score corresponding to  43  is  0.9989404777035886
r2 score corresponding to  44  is  0.998660033408792
r2 score corresponding to  45  is  0.9988673029841392
r2 score corresponding to  46  is  0.9985415608916136
r2 score corresponding to  47  is  0.998709377140152
r2 score corresponding to  48  is  0.9988132196189904
r2 score corresponding to  49  is  0.9988705928928397
r2 score corresponding to  50  is  0.9982719152088992
r2 score corresponding to  51  is  0.998382287837567
r2 score corresponding to  52  is  0.9984217196175054
r2 score corresponding to  53  is  0.9987922163042491
r2 score corresponding to  54  is  0.9990172007145903
r2 score corresponding to  55  is  0.9988715504573773
r2 score corresponding to  56  is  0.9988505872056118
r2 score corresponding to  57  is  0.9984871890191858
r2 score corresponding to  58  is  0.9987630289035986
r2 score corresponding to  59  is  0.9984031663484343
r2 score corresponding to  60  is  0.9988579688666427
r2 score corresponding to  61  is  0.9986779998399288
r2 score corresponding to  62  is  0.9991131996233572
r2 score corresponding to  63  is  0.99900150507828
r2 score corresponding to  64  is  0.998828918804824
r2 score corresponding to  65  is  0.9984966992798603
r2 score corresponding to  66  is  0.999014202706449
r2 score corresponding to  67  is  0.9988882820916499
r2 score corresponding to  68  is  0.9985628798614324
r2 score corresponding to  69  is  0.9989699055613677
r2 score corresponding to  70  is  0.9988497037319611
r2 score corresponding to  71  is  0.9989697838933294
r2 score corresponding to  72  is  0.9991445693164097
r2 score corresponding to  73  is  0.9984050838619943
r2 score corresponding to  74  is  0.9985016368938067
r2 score corresponding to  75  is  0.9990354985082923
r2 score corresponding to  76  is  0.9989835143623281
r2 score corresponding to  77  is  0.9990048354664752
r2 score corresponding to  78  is  0.9987329440395523
r2 score corresponding to  79  is  0.9988116014682878
r2 score corresponding to  80  is  0.9988217213591856
r2 score corresponding to  81  is  0.9988063682111386
r2 score corresponding to  82  is  0.9988777687110284
r2 score corresponding to  83  is  0.9986248030357849
r2 score corresponding to  84  is  0.9989549876469046
r2 score corresponding to  85  is  0.9982942049153051
r2 score corresponding to  86  is  0.9988894148838963
r2 score corresponding to  87  is  0.9987327675650816
r2 score corresponding to  88  is  0.9987729057207656
r2 score corresponding to  89  is  0.9988565900248781
r2 score corresponding to  90  is  0.9988506190826056
r2 score corresponding to  91  is  0.9982519450631586
r2 score corresponding to  92  is  0.9989638977804529
r2 score corresponding to  93  is  0.99851106274372
r2 score corresponding to  94  is  0.9991208542060193
r2 score corresponding to  95  is  0.998702183359967
r2 score corresponding to  96  is  0.9990691885571106
r2 score corresponding to  97  is  0.9988144307248722
r2 score corresponding to  98  is  0.999031032704753
r2 score corresponding to  99  is  0.9988122564332789
max r2 score corresponding to  72  is  0.9991445693164097

In [171]:
from sklearn.model_selection import cross_val_score
cross_val_score(sklearn.linear_model.LinearRegression(),x,y,cv=10,scoring="r2").mean()

0.9815496166169295

In [172]:
from sklearn.model_selection import cross_val_score
cross_val_score(sklearn.tree.DecisionTreeRegressor(),x,y,cv=10,scoring="r2").mean()

0.9989326084756804

In [173]:

#Lets save above model
from sklearn.externals import joblib 
  
# Save the model as a pickle in a file 
joblib.dump(regr, 'salary.pkl')

['salary.pkl']